tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# tap "buo/cask-upgrade"


==> Formulae
ansible
ansible-lint
bat
eza
fzf
starship

==> Casks
1password
1password-cli
autodesk-fusion
balenaetcher
discord
firefox
font-inconsolata-for-powerline
font-inconsolata-nerd-font
google-chrome
halloy
itsycal
knockknock
localsend
obsidian
orcaslicer
pearcleaner
philips-hue-sync
raycast
soundsource
stats
steam
suspicious-package
syncthing
tailscale
tor-browser
visual-studio-code
warp
xpipe

######################## Brews ########################################################
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Minimal dumb-terminal emulation program
brew "picocom"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Subversion (needed to install some fonts)
brew "svn"
# User interface to the TELNET protocol
brew "telnet"
# Internet file retriever
brew "wget"

######################## Casks ########################################################
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Voice and text chat software
cask "discord"
# Hex editor focussing on speed
cask "hex-fiend"
# Advanced Mac system monitor for your menubar
cask "istat-menus"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Launchbar / spotlight replacement
cask "launchbar"
# Host-based application firewall
cask "little-snitch"
# Programmable solid 3D CAD modeller
cask "openscad"
# PL2303 USB-to-serial driver
# cask "prolific-pl2303"
# code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# CP210x USB to UART Bridge VCP Driver
# cask "silicon-labs-vcp-driver"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Convert 3D models into G-code instructions or PNG layers
cask "superslicer"
# Application for inspecting installer packages
cask "suspicious-package"
# Peer-to-peer file syncing
cask "syncthing"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# VLC media player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Remote desktop application focusing on security
cask "vnc-viewer"

######################## App Store ####################################################
# Note: Use `mas list` or `mas search` to find IDs
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Baking Soda", id: 1601151613
mas "Bumpr", id: 1166066070
mas "DaisyDisk", id: 411643860
mas "Downlink", id: 1454269192
mas "Luxafor", id: 1559879690
mas "Mactracker", id: 430255202
mas "Microsoft To Do", id: 1274495053
mas "Monosnap", id: 540348655
mas "NordVPN", id: 905953485
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "Tailscale", id: 1475387142
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835

######################## Fonts ########################################################
brew "font-meslo-for-powerline"
