# Formulas applicable to all platforms

# IT automation tool used to configure systems and manage infrastructure using simple, agentless YAML playbooks
brew "ansible"
# Checks Ansible playbooks, roles, and collections for best-practice violations, errors, and style issues
brew "ansible-lint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"

# A typeface for developers augmented by Nerd Fonts
cask "font-jetbrains-mono-nerd-font"

if OS.mac?
# MacOS-only
###########################################################
# Permanent TouchID support for sudo
tap "artginzburg/tap"
brew "artginzburg/tap/sudo-touchid"
# Mac App Store command-line interface
brew "mas"
# Network protocol and command-line tool for remotely connecting to other computers over TCP/IP
brew "telnet"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Capture, record, and process audio from any application or input in real time
cask "audio-hijack"
# Free, open-source tool used to safely and easily write disk images to USB drives and SD cards
cask "balenaetcher"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Open-source KVM-style tool that lets you share one keyboard and mouse seamlessly across multiple computers on the same network
cask "deskflow"
# Free communication platform that combines text, voice, and video chat in organized servers and channels for communities and teams
cask "discord"
# Free, open-source web browser focused on speed, privacy, and user control, developed by Mozilla
cask "firefox"
# Fast, GPU-accelerated terminal emulator designed to be lightweight, modern, and highly customizable
cask "ghostty"
# Menu-bar utility that lets you hide, show, and organize menu-bar icons to reduce clutter
cask "hiddenbar"
# Lightweight menu-bar calendar app that shows your calendar and upcoming events at a glance
cask "itsycal"
# Free security tool that scans your system for persistent malware and other automatically launched software
cask "knockknock"
# Open-source app that lets you securely share files and messages between devices on the same local network without using the internet
cask "localsend"
# App that uses OpenAI’s Whisper model to transcribe and translate audio into text locally with high accuracy
cask "macwhisper"
# Powerful note-taking and knowledge-management app that uses linked Markdown files to build a personal knowledge base
cask "obsidian"
# Free, open-source 3D printer slicer that generates optimized G-code with advanced tuning and calibration tools
cask "orcaslicer"
# Utility that thoroughly uninstalls apps by removing associated leftover files and system traces
cask "pearcleaner"
# Desktop app that synchronizes your Hue lights with on-screen video, music, or games for immersive ambient lighting effects
cask "philips-hue-sync"
# Open-source Minecraft launcher that lets you easily manage multiple instances, mods, and modpacks
cask "prismlauncher"
# Official tool for easily installing operating systems onto SD cards or USB drives for Raspberry Pi computers
cask "raspberry-pi-imager"
# Open-source remote desktop and support tool that provides fast, secure, self-hostable screen sharing and remote control
cask "rustdesk"
# Audio control app that lets you adjust volume, apply effects, and manage output settings for individual apps
cask "soundsource"
# Menu-bar system monitor that shows real-time CPU, GPU, memory, disk, battery, and network usage
cask "stats"
# Video game digital distribution service
cask "steam"
# Inspect installer packages to see exactly what files and scripts they will install before running them
cask "suspicious-package"
# Open source continuous file synchronization application
cask "syncthing-app"
# Zero-config VPN built on WireGuard that securely connects your devices into a private mesh network
cask "tailscale-app"
# Free, cross-platform code editor with built-in debugging, extensions, and Git support for modern software development
cask "visual-studio-code"

# USB-connected LED status light that visually signals your availability or focus state to others
# mas "Luxafor", id: 1559879690
# Screenshot and screen-recording app that lets you capture, annotate, and quickly share images and videos
mas "Monosnap", id: 540348655
# Helps you save, organize, and cook from recipes with built-in grocery lists and meal planning
mas "Paprika Recipe Manager 3", id: 1303222628
# Free messaging app that lets users send text messages over the internet with end-to-end encryption
mas "WhatsApp", id: 310633997

else
# Linux-only
###########################################################
end
